/*
 Од стандарден влез се читаат елементите на една матрица (A), составена од природни броеви. Прво се читаат бројот на редици N и бројот на колони M на матрицата (N, M < 100), а потоа и самите елементи на матрицата.

За секоја редица, да се испечати индексот на редицата и бројот на штосни броеви во таа редица во формат indeks_na_redica: broj_na_stosni_broevi_vo_taa_redica (види тест пример).

Штосен број е број чија парност е иста со парноста на збирот од индексите на редицата и колоната на елементот.




Помош:

Штосен елемент: парноста на елементот Aij е иста со парноста на i + j

- ако i=11, j=21, а елементот Aij има вредност 14, тогаш тој е штосен број бидејќи 11 + 21 = 32 што е парен број, а и 14 е исто така парен број

Пример:

Влез:

4  5

0    1    2    3    4

6    6    7    7    8

11    22    21    24    13

0    1    21    4    21

Излез:

0: 5

1: 2

2: 0

3: 3




Објаснување:

Во матрицата A штосни броеви се:

во 1вата редица се броевите 0, 1, 2, 3, 4, вкупниот број на штосни броеви е 5 и се печати 0: 5

во 2рата редица се броевите 6, 7, вкупниот број на штосни броеви е 2 и се печати 1: 2

во 3тата редица нема штосни броеви и се печати 2: 0

во 4тата редица се броевите 21, 4, 21, вкупниот број на штосни броеви е 3 и се печати 3: 3
 */

#include <iostream>
#include <cstring>
#include <cmath>
using namespace std;


int brojShtosni (int a[100][100],int i , int m){
    int countShtosni = 0;
    for (int j = 0; j < m; ++j) {
        if (a[i][j] % 2 == 0 && (i+j) % 2 == 0){
            countShtosni ++;
        }
        if (a[i][j] % 2 == 1 && (i+j) % 2 == 1){
            countShtosni ++;
        }
    }
    return countShtosni;
}


int main() {

    int a[100][100];
    int n , m;
    cin >> n >> m;

    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            cin >> a[i][j];
        }
    }

    for (int i = 0; i < n; ++i) {
        cout << i << ": " << brojShtosni(a,i,m) << endl;
    }



    return 0;
}