/*
 Од стандарден влез се задава димензијата на една матрица Аmxn (m,n<=100), а во продолжение се читаат елементите на матрицата. Елементите на матрицата се цели броеви.

Да се испечатат сите збирови кои се добиваат со испишување на шаблонот за буквата N во матрицата A. Првиот шаблон се добива од подматрицата А1 (2x2) почнувајќи од индекс (0,0) во матрицата А, наредниот од подматрицата А2 (3x3) исто така почнувајќи од индекс (0,0) во матрицата А итн.
 Влез:

4
5

1 2 3 4 5

6 7 8 9 10

11 12 13 14 15

16 17 18 19 20


Излез:

16
49
100
 */

#include <iostream>
#include <cstring>
#include <cmath>
using namespace std;



int main() {

    int a[100][100];
    int sum = 0;
    int n , m;
    cin >> n >> m;

    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            cin >> a[i][j];
        }
    }

    int min = n<=m ? n:m;
    for (int i = 2; i <=min ; ++i) {
        sum = 0;
        for (int j = 1; j < i ; ++j) {
            sum += a[j][0];
        }
        for (int j = 0; j < i-1; ++j) {
            sum += a[j][i-1];
        }
        for (int j = 0; j < i; ++j) {
            sum += a[j][j];
        }
        cout << sum << endl;

    }



    return 0;
}
